In [3]:
import sqlite3 as sql 
from datetime import date 
conn = sql.connect('customer.db') 
c = conn.cursor()
c.execute("""CREATE TABLE recipe13( id int(11), name varchar(400), description text, category_id int(11), 
 chef_id varchar(255), created datetime
)
""") 
conn.commit() 
many_recipes = [(1, 'Paneer', 'Indian', 1, 'BL000001', now.strftime('%Y-%m-%d %H:%M:%S')),
(2, 'Chowmein', 'Chinese', 2, 'BL000002',now.strftime('%Y-%m-%d %H:%M:%S')),
(3, 'Pasta', 'Italian', 3, 'BL000003',now.strftime('%Y-%m-%d %H:%M:%S')),
(4, 'Momos', 'Tibetan', 4, 'BL000004',now.strftime('%Y-%m-%d %H:%M:%S')),
(5, 'Khichdi', 'Indian', 5,'BL000005',now.strftime('%Y-%m-%d %H:%M:%S'))
]
c.executemany("INSERT INTO recipe13 VALUES (?,?,?,?,?,?)", many_recipes)
conn.commit()

NameError: name 'now' is not defined

In [15]:
c.execute("SELECT * FROM recipe1 WHERE description ='Chinese'")
print(c.fetchall())

[(2, 'Chowmein', 'Chinese', 2, 'BL000002', '2022-04-26 21:29:31')]

In [16]:
c.execute("SELECT id, name FROM recipe1 WHERE chef_id ='BL000002'")
print(c.fetchall())

[(2, 'Chowmein')]

In [18]:
c.execute("SELECT description FROM recipe1 WHERE name LIKE 'P%'")
print(c.fetchall())
conn.close()

[('Indian',), ('Italian',)]

In [19]:
conn.close()

In [ ]:
                                              Question-2

In [21]:
import sqlite3 as sql
conn = sql.connect('customer.db')
c = conn.cursor()
c.execute("""CREATE TABLE movies( movie_id int, movie_name text,genre text, language text, rating int
)
""")
conn.commit()
many_movies = [(101, 'The Matrix', 'Action', 'English', 9),
(102, 'The Fault in Our Stars', 'Melodrama','English', 8),
(103, 'KGF', 'Action', 'Hindi', 9),
(104, '83', 'Historical', 'Hindi',7),
(105, 'Tadap', 'Fictional', 'Hindi',5)
]
c.executemany("INSERT INTO movies VALUES (?,?,?,?,?)", many_movies)
conn.commit()

In [22]:
c.execute("SELECT * FROM movies")
items = c.fetchall()
print("Original Table")
for item in items:
    print(item)
c.execute("UPDATE movies SET rating = rating+rating*0.1 WHERE movie_id = movie_id")
conn.commit()
print("After query 1")
c.execute("SELECT * FROM movies")
items = c.fetchall()
for item in items:
    print(item)

Original Table
(101, 'The Matrix', 'Action', 'English', 9)
(102, 'The Fault in Our Stars', 'Melodrama', 'English', 8)
(103, 'KGF', 'Action', 'Hindi', 9)
(104, '83', 'Historical', 'Hindi', 7)
(105, 'Tadap', 'Fictional', 'Hindi', 5)
After query 1
(101, 'The Matrix', 'Action', 'English', 9.9)
(102, 'The Fault in Our Stars', 'Melodrama', 'English', 8.8)
(103, 'KGF', 'Action', 'Hindi', 9.9)
(104, '83', 'Historical', 'Hindi', 7.7)
(105, 'Tadap', 'Fictional', 'Hindi', 5.5)

In [23]:
c.execute("DELETE FROM movies WHERE movie_id = 102")
conn.commit()
print("After query 2")
c.execute("SELECT * FROM movies")
items = c.fetchall()
for item in items:
    print(item)

After query 2
(101, 'The Matrix', 'Action', 'English', 9.9)
(103, 'KGF', 'Action', 'Hindi', 9.9)
(104, '83', 'Historical', 'Hindi', 7.7)
(105, 'Tadap', 'Fictional', 'Hindi', 5.5)

In [24]:
print("After Query 3")
c.execute("SELECT * FROM movies WHERE rating > 3")
print(c.fetchall())
conn.close()

After Query 3
[(101, 'The Matrix', 'Action', 'English', 9.9), (103, 'KGF', 'Action', 'Hindi', 9.9), (104, '83', 'Historical', 'Hindi', 7.7), (105, 'Tadap', 'Fictional', 'Hindi', 5.5)]

In [25]:
conn.close()

In [ ]:
                                        Question-3

In [67]:
import sqlite3 as sql
conn = sql.connect('course.db')
c = conn.cursor()
c.execute("""CREATE TABLE Product8(id int primary key, prod_name text, supplier_id int, unit_price int,package text
, order_id int
)
""")
c.execute("""CREATE TABLE OrderItem8(id int primary key, order_id int, product_id int, unit_price int, quantity int
,
foreign key(order_id) references Product8(id)
)
""")
conn.commit() 
many_product = [(1, 'Laptop', 101, 10000, 'Cardboard',201),
(2, 'Milk', 102, 50, 'Plastic', 202),
(3, 'Notebook', 103, 80, 'Polyethene',203),
(4, 'Shirt', 104, 2000, 'Paper', 204)
]
many_order = [(1, 202, 2, 50, 20),
(2, 204, 4, 2000,30),
(3, 201, 1, 10000, 10),
(4, 203, 3, 80, 15)
]
c.executemany("INSERT INTO Product8 VALUES(?,?,?,?,?,?)",many_product)
c.executemany("INSERT INTO OrderItem8 VALUES(?,?,?,?,?)",many_order)
conn.commit()

In [69]:
c.execute("SELECT id,quantity FROM OrderItem8 ")
a=c.fetchall()
for r,q in a:
    print(r,end= " : ")
    print(q)

1 : 20
2 : 30
3 : 10
4 : 15

In [71]:
items = c.execute("SELECT unit_price,supplier_id FROM Product8 ORDER BY unit_price")
for item in items: 
    print(item)

(50, 102)
(80, 103)
(2000, 104)
(10000, 101)

In [72]:
items = c.execute("SELECT prod_name,order_id,supplier_id FROM Product8")
for item in items: 
    print(item)

('Laptop', 201, 101)
('Milk', 202, 102)
('Notebook', 203, 103)
('Shirt', 204, 104)

In [ ]:
                                        Question-4

In [63]:
import sqlite3 as sql
conn = sql.connect('customer.db')
c = conn.cursor()
c.execute("""CREATE TABLE Job9(job_id int(11) PRIMARY KEY, job_title varchar(100), min_salary int(225),
max_salary int(225)
)
""") 
conn.commit()
many_jobs = [(1,'CEO',250000,7500000),
(2,'Artist',10000,50000),
(3,'Manager',35000,100000),
(4,'Software Engineer',50000,1000000),
(5,'Architect',10000,100000)
]
c.executemany("INSERT INTO Job9 VALUES(?,?,?,?)", many_jobs)
conn.commit()

In [64]:
c.execute("SELECT * FROM Job9") 
items = c.fetchall()
for item in items:
    print(item)

(1, 'CEO', 250000, 7500000)
(2, 'Artist', 10000, 50000)
(3, 'Manager', 35000, 100000)
(4, 'Software Engineer', 50000, 1000000)
(5, 'Architect', 10000, 100000)

In [ ]:
                                          Question-5

In [52]:
import sqlite3 as sql
conn = sql.connect('customer.db')
c = conn.cursor()
c.execute("""CREATE TABLE   job_history(employee_ID int(11) PRIMARY KEY, start_date DATE, end_date DATE,
job_id int(225), dept_id int(225), FOREIGN KEY (job_id) REFERENCES jobs(job_id)
)
""")
conn.commit()
many_history = [(20552,'2010-04-30','2020-07-21',5067,7621),
(20553,'2013-08-05','2015-03-17',5101,7623),
(20550,'2012-10-27','2022-12-17',5001,7628), 
(20554,'2009-07-25','2022-01-01',5008,7620),
(20551,'2014-03-23','2019-06-21',5089,7623)
]
c.executemany("INSERT INTO job_history VALUES(?,?,?,?,?)", many_history)
conn.commit()

In [53]:
c.execute("SELECT * FROM job_history")
items = c.fetchall()
for item in items:
    print(item)

(20552, '2010-04-30', '2020-07-21', 5067, 7621)
(20553, '2013-08-05', '2015-03-17', 5101, 7623)
(20550, '2012-10-27', '2022-12-17', 5001, 7628)
(20554, '2009-07-25', '2022-01-01', 5008, 7620)
(20551, '2014-03-23', '2019-06-21', 5089, 7623)

In [ ]:
                                           Advanced section

In [75]:
import sqlite3 as sql
conn = sql.connect('customer.db')
c = conn.cursor()
c.execute("""CREATE TABLE Product1(prod_id int(11) PRIMARY KEY,prod_name text,price int,manufacturer text
,quantity int)
""")
conn.commit()
many_products=[(12512,'modelS',120000,'tesla',5),
(12612,'crewdragon',100,'ABC',8),
(12712,'starliner',225,'boeing',10),
(12812,'iphone12',999,'apple',15),
(12912,'surfacepro',1200,'ABC',100)
]
c.executemany("INSERT INTO Product1 VALUES(?,?,?,?,?)",many_products)
conn.commit()

In [76]:
c.execute("SELECT * FROM Product1 ORDER BY price DESC LIMIT 3")
items = c.fetchall()
for item in items:
    print(item)

(12512, 'modelS', 120000, 'tesla', 5)
(12912, 'surfacepro', 1200, 'ABC', 100)
(12812, 'iphone12', 999, 'apple', 15)

In [77]:
c.execute("SELECT * FROM Product1 where manufacturer='ABC' and price<200")
items = c.fetchall()
for item in items:
    print(item)

(12612, 'crewdragon', 100, 'ABC', 8)

In [78]:
c.execute("SELECT prod_name FROM Product1 where price between 20 and 200")
items = c.fetchall()
for item in items:
    print(item)

('crewdragon',)

In [79]:
c.execute("SELECT count(*) AS NumProduct  FROM Product1")
print(c.fetchall())

[(5,)]

In [85]:
c.execute("SELECT * from Product1 where manufacturer BETWEEN 'A' AND 'C'")
items = c.fetchall()
for item in items:
    print(item)

(12612, 'crewdragon', 100, 'ABC', 8)
(12912, 'surfacepro', 1200, 'ABC', 100)

In [86]:
c.execute("select * from Product1 group by price order by price desc limit 1,1")
print(c.fetchall())

[(12912, 'surfacepro', 1200, 'ABC', 100)]

In [87]:
c.execute("select * from Product1 where price > (Select AVG(price) From Product1)")
items = c.fetchall()
for item in items:
    print(item)

(12512, 'modelS', 120000, 'tesla', 5)

In [88]:
c.execute("SELECT * FROM Product1 ORDER BY price DESC LIMIT 5")
items = c.fetchall()
for item in items:
    print(item)

(12512, 'modelS', 120000, 'tesla', 5)
(12912, 'surfacepro', 1200, 'ABC', 100)
(12812, 'iphone12', 999, 'apple', 15)
(12712, 'starliner', 225, 'boeing', 10)
(12612, 'crewdragon', 100, 'ABC', 8)